apps/benchmark-runner/tests/fixtures/omni_bench_stdout.txt
============ Serving Benchmark Result ============
Successful requests:                     4
Benchmark duration (s):                  35.20
Total input tokens:                      2000
Total generated tokens:                  1200
Request throughput (req/s):              0.11
Output token throughput (tok/s):         34.09
Total Token throughput (tok/s):          90.91
---------------Time to First Token----------------
Mean TTFT (ms):                          66.30
Median TTFT (ms):                        61.00
P99 TTFT (ms):                           120.50
----------------End-to-end Latency----------------
Mean E2EL (ms):                          8501.20
Median E2EL (ms):                        8400.00
P99 E2EL (ms):                           9100.00
--------------------AUDIO_TTFP--------------------
Mean AUDIO_TTFP (ms):                    511.00
Median AUDIO_TTFP (ms):                  490.00
P99 AUDIO_TTFP (ms):                     900.00
--------------------AUDIO_RTF---------------------
Mean AUDIO_RTF:                          0.19
Median AUDIO_RTF:                        0.18
P99 AUDIO_RTF:                           0.30
==================================================